nammenam/playground/flightcomputer/firmware/src/packs/ATSAME53J18A_DFP/component/sdhc.h
/* -------- SDHC_TMR : (SDHC Offset: 0x0C) (R/W 16) Transfer Mode -------- */
#define SDHC_TMR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_TMR) Transfer Mode  Reset Value */

#define SDHC_TMR_DMAEN_Pos                    _UINT16_(0)                                          /* (SDHC_TMR) DMA Enable Position */
#define SDHC_TMR_DMAEN_Msk                    (_UINT16_(0x1) << SDHC_TMR_DMAEN_Pos)                /* (SDHC_TMR) DMA Enable Mask */
#define SDHC_TMR_DMAEN(value)                 (SDHC_TMR_DMAEN_Msk & (_UINT16_(value) << SDHC_TMR_DMAEN_Pos)) /* Assigment of value for DMAEN in the SDHC_TMR register */
#define   SDHC_TMR_DMAEN_DISABLE_Val          _UINT16_(0x0)                                        /* (SDHC_TMR) No data transfer or Non DMA data transfer  */
#define   SDHC_TMR_DMAEN_ENABLE_Val           _UINT16_(0x1)                                        /* (SDHC_TMR) DMA data transfer  */
#define SDHC_TMR_DMAEN_DISABLE                (SDHC_TMR_DMAEN_DISABLE_Val << SDHC_TMR_DMAEN_Pos)   /* (SDHC_TMR) No data transfer or Non DMA data transfer Position  */
#define SDHC_TMR_DMAEN_ENABLE                 (SDHC_TMR_DMAEN_ENABLE_Val << SDHC_TMR_DMAEN_Pos)    /* (SDHC_TMR) DMA data transfer Position  */
#define SDHC_TMR_BCEN_Pos                     _UINT16_(1)                                          /* (SDHC_TMR) Block Count Enable Position */
#define SDHC_TMR_BCEN_Msk                     (_UINT16_(0x1) << SDHC_TMR_BCEN_Pos)                 /* (SDHC_TMR) Block Count Enable Mask */
#define SDHC_TMR_BCEN(value)                  (SDHC_TMR_BCEN_Msk & (_UINT16_(value) << SDHC_TMR_BCEN_Pos)) /* Assigment of value for BCEN in the SDHC_TMR register */
#define   SDHC_TMR_BCEN_DISABLE_Val           _UINT16_(0x0)                                        /* (SDHC_TMR) Disable  */
#define   SDHC_TMR_BCEN_ENABLE_Val            _UINT16_(0x1)                                        /* (SDHC_TMR) Enable  */
#define SDHC_TMR_BCEN_DISABLE                 (SDHC_TMR_BCEN_DISABLE_Val << SDHC_TMR_BCEN_Pos)     /* (SDHC_TMR) Disable Position  */
#define SDHC_TMR_BCEN_ENABLE                  (SDHC_TMR_BCEN_ENABLE_Val << SDHC_TMR_BCEN_Pos)      /* (SDHC_TMR) Enable Position  */
#define SDHC_TMR_ACMDEN_Pos                   _UINT16_(2)                                          /* (SDHC_TMR) Auto Command Enable Position */
#define SDHC_TMR_ACMDEN_Msk                   (_UINT16_(0x3) << SDHC_TMR_ACMDEN_Pos)               /* (SDHC_TMR) Auto Command Enable Mask */
#define SDHC_TMR_ACMDEN(value)                (SDHC_TMR_ACMDEN_Msk & (_UINT16_(value) << SDHC_TMR_ACMDEN_Pos)) /* Assigment of value for ACMDEN in the SDHC_TMR register */
#define   SDHC_TMR_ACMDEN_DISABLED_Val        _UINT16_(0x0)                                        /* (SDHC_TMR) Auto Command Disabled  */
#define   SDHC_TMR_ACMDEN_CMD12_Val           _UINT16_(0x1)                                        /* (SDHC_TMR) Auto CMD12 Enable  */
#define   SDHC_TMR_ACMDEN_CMD23_Val           _UINT16_(0x2)                                        /* (SDHC_TMR) Auto CMD23 Enable  */
#define SDHC_TMR_ACMDEN_DISABLED              (SDHC_TMR_ACMDEN_DISABLED_Val << SDHC_TMR_ACMDEN_Pos) /* (SDHC_TMR) Auto Command Disabled Position  */
#define SDHC_TMR_ACMDEN_CMD12                 (SDHC_TMR_ACMDEN_CMD12_Val << SDHC_TMR_ACMDEN_Pos)   /* (SDHC_TMR) Auto CMD12 Enable Position  */
#define SDHC_TMR_ACMDEN_CMD23                 (SDHC_TMR_ACMDEN_CMD23_Val << SDHC_TMR_ACMDEN_Pos)   /* (SDHC_TMR) Auto CMD23 Enable Position  */
#define SDHC_TMR_DTDSEL_Pos                   _UINT16_(4)                                          /* (SDHC_TMR) Data Transfer Direction Selection Position */
#define SDHC_TMR_DTDSEL_Msk                   (_UINT16_(0x1) << SDHC_TMR_DTDSEL_Pos)               /* (SDHC_TMR) Data Transfer Direction Selection Mask */
#define SDHC_TMR_DTDSEL(value)                (SDHC_TMR_DTDSEL_Msk & (_UINT16_(value) << SDHC_TMR_DTDSEL_Pos)) /* Assigment of value for DTDSEL in the SDHC_TMR register */
#define   SDHC_TMR_DTDSEL_WRITE_Val           _UINT16_(0x0)                                        /* (SDHC_TMR) Write (Host to Card)  */
#define   SDHC_TMR_DTDSEL_READ_Val            _UINT16_(0x1)                                        /* (SDHC_TMR) Read (Card to Host)  */
#define SDHC_TMR_DTDSEL_WRITE                 (SDHC_TMR_DTDSEL_WRITE_Val << SDHC_TMR_DTDSEL_Pos)   /* (SDHC_TMR) Write (Host to Card) Position  */
#define SDHC_TMR_DTDSEL_READ                  (SDHC_TMR_DTDSEL_READ_Val << SDHC_TMR_DTDSEL_Pos)    /* (SDHC_TMR) Read (Card to Host) Position  */
#define SDHC_TMR_MSBSEL_Pos                   _UINT16_(5)                                          /* (SDHC_TMR) Multi/Single Block Selection Position */
#define SDHC_TMR_MSBSEL_Msk                   (_UINT16_(0x1) << SDHC_TMR_MSBSEL_Pos)               /* (SDHC_TMR) Multi/Single Block Selection Mask */
#define SDHC_TMR_MSBSEL(value)                (SDHC_TMR_MSBSEL_Msk & (_UINT16_(value) << SDHC_TMR_MSBSEL_Pos)) /* Assigment of value for MSBSEL in the SDHC_TMR register */
#define   SDHC_TMR_MSBSEL_SINGLE_Val          _UINT16_(0x0)                                        /* (SDHC_TMR) Single Block  */
#define   SDHC_TMR_MSBSEL_MULTIPLE_Val        _UINT16_(0x1)                                        /* (SDHC_TMR) Multiple Block  */
#define SDHC_TMR_MSBSEL_SINGLE                (SDHC_TMR_MSBSEL_SINGLE_Val << SDHC_TMR_MSBSEL_Pos)  /* (SDHC_TMR) Single Block Position  */
#define SDHC_TMR_MSBSEL_MULTIPLE              (SDHC_TMR_MSBSEL_MULTIPLE_Val << SDHC_TMR_MSBSEL_Pos) /* (SDHC_TMR) Multiple Block Position  */
#define SDHC_TMR_Msk                          _UINT16_(0x003F)                                     /* (SDHC_TMR) Register Mask  */


/* -------- SDHC_CR : (SDHC Offset: 0x0E) (R/W 16) Command -------- */
#define SDHC_CR_RESETVALUE                    _UINT16_(0x00)                                       /*  (SDHC_CR) Command  Reset Value */

#define SDHC_CR_RESPTYP_Pos                   _UINT16_(0)                                          /* (SDHC_CR) Response Type Position */
#define SDHC_CR_RESPTYP_Msk                   (_UINT16_(0x3) << SDHC_CR_RESPTYP_Pos)               /* (SDHC_CR) Response Type Mask */
#define SDHC_CR_RESPTYP(value)                (SDHC_CR_RESPTYP_Msk & (_UINT16_(value) << SDHC_CR_RESPTYP_Pos)) /* Assigment of value for RESPTYP in the SDHC_CR register */
#define   SDHC_CR_RESPTYP_NONE_Val            _UINT16_(0x0)                                        /* (SDHC_CR) No response  */
#define   SDHC_CR_RESPTYP_136_BIT_Val         _UINT16_(0x1)                                        /* (SDHC_CR) 136-bit response  */
#define   SDHC_CR_RESPTYP_48_BIT_Val          _UINT16_(0x2)                                        /* (SDHC_CR) 48-bit response  */
#define   SDHC_CR_RESPTYP_48_BIT_BUSY_Val     _UINT16_(0x3)                                        /* (SDHC_CR) 48-bit response check busy after response  */
#define SDHC_CR_RESPTYP_NONE                  (SDHC_CR_RESPTYP_NONE_Val << SDHC_CR_RESPTYP_Pos)    /* (SDHC_CR) No response Position  */
#define SDHC_CR_RESPTYP_136_BIT               (SDHC_CR_RESPTYP_136_BIT_Val << SDHC_CR_RESPTYP_Pos) /* (SDHC_CR) 136-bit response Position  */
#define SDHC_CR_RESPTYP_48_BIT                (SDHC_CR_RESPTYP_48_BIT_Val << SDHC_CR_RESPTYP_Pos)  /* (SDHC_CR) 48-bit response Position  */
#define SDHC_CR_RESPTYP_48_BIT_BUSY           (SDHC_CR_RESPTYP_48_BIT_BUSY_Val << SDHC_CR_RESPTYP_Pos) /* (SDHC_CR) 48-bit response check busy after response Position  */
#define SDHC_CR_CMDCCEN_Pos                   _UINT16_(3)                                          /* (SDHC_CR) Command CRC Check Enable Position */
#define SDHC_CR_CMDCCEN_Msk                   (_UINT16_(0x1) << SDHC_CR_CMDCCEN_Pos)               /* (SDHC_CR) Command CRC Check Enable Mask */
#define SDHC_CR_CMDCCEN(value)                (SDHC_CR_CMDCCEN_Msk & (_UINT16_(value) << SDHC_CR_CMDCCEN_Pos)) /* Assigment of value for CMDCCEN in the SDHC_CR register */
#define   SDHC_CR_CMDCCEN_DISABLE_Val         _UINT16_(0x0)                                        /* (SDHC_CR) Disable  */
#define   SDHC_CR_CMDCCEN_ENABLE_Val          _UINT16_(0x1)                                        /* (SDHC_CR) Enable  */
#define SDHC_CR_CMDCCEN_DISABLE               (SDHC_CR_CMDCCEN_DISABLE_Val << SDHC_CR_CMDCCEN_Pos) /* (SDHC_CR) Disable Position  */
#define SDHC_CR_CMDCCEN_ENABLE                (SDHC_CR_CMDCCEN_ENABLE_Val << SDHC_CR_CMDCCEN_Pos)  /* (SDHC_CR) Enable Position  */
#define SDHC_CR_CMDICEN_Pos                   _UINT16_(4)                                          /* (SDHC_CR) Command Index Check Enable Position */
#define SDHC_CR_CMDICEN_Msk                   (_UINT16_(0x1) << SDHC_CR_CMDICEN_Pos)               /* (SDHC_CR) Command Index Check Enable Mask */
#define SDHC_CR_CMDICEN(value)                (SDHC_CR_CMDICEN_Msk & (_UINT16_(value) << SDHC_CR_CMDICEN_Pos)) /* Assigment of value for CMDICEN in the SDHC_CR register */
#define   SDHC_CR_CMDICEN_DISABLE_Val         _UINT16_(0x0)                                        /* (SDHC_CR) Disable  */
#define   SDHC_CR_CMDICEN_ENABLE_Val          _UINT16_(0x1)                                        /* (SDHC_CR) Enable  */
#define SDHC_CR_CMDICEN_DISABLE               (SDHC_CR_CMDICEN_DISABLE_Val << SDHC_CR_CMDICEN_Pos) /* (SDHC_CR) Disable Position  */
#define SDHC_CR_CMDICEN_ENABLE                (SDHC_CR_CMDICEN_ENABLE_Val << SDHC_CR_CMDICEN_Pos)  /* (SDHC_CR) Enable Position  */
#define SDHC_CR_DPSEL_Pos                     _UINT16_(5)                                          /* (SDHC_CR) Data Present Select Position */
#define SDHC_CR_DPSEL_Msk                     (_UINT16_(0x1) << SDHC_CR_DPSEL_Pos)                 /* (SDHC_CR) Data Present Select Mask */
#define SDHC_CR_DPSEL(value)                  (SDHC_CR_DPSEL_Msk & (_UINT16_(value) << SDHC_CR_DPSEL_Pos)) /* Assigment of value for DPSEL in the SDHC_CR register */
#define   SDHC_CR_DPSEL_NO_DATA_Val           _UINT16_(0x0)                                        /* (SDHC_CR) No Data Present  */
#define   SDHC_CR_DPSEL_DATA_Val              _UINT16_(0x1)                                        /* (SDHC_CR) Data Present  */
#define SDHC_CR_DPSEL_NO_DATA                 (SDHC_CR_DPSEL_NO_DATA_Val << SDHC_CR_DPSEL_Pos)     /* (SDHC_CR) No Data Present Position  */
#define SDHC_CR_DPSEL_DATA                    (SDHC_CR_DPSEL_DATA_Val << SDHC_CR_DPSEL_Pos)        /* (SDHC_CR) Data Present Position  */
#define SDHC_CR_CMDTYP_Pos                    _UINT16_(6)                                          /* (SDHC_CR) Command Type Position */
#define SDHC_CR_CMDTYP_Msk                    (_UINT16_(0x3) << SDHC_CR_CMDTYP_Pos)                /* (SDHC_CR) Command Type Mask */
#define SDHC_CR_CMDTYP(value)                 (SDHC_CR_CMDTYP_Msk & (_UINT16_(value) << SDHC_CR_CMDTYP_Pos)) /* Assigment of value for CMDTYP in the SDHC_CR register */
#define   SDHC_CR_CMDTYP_NORMAL_Val           _UINT16_(0x0)                                        /* (SDHC_CR) Other commands  */
#define   SDHC_CR_CMDTYP_SUSPEND_Val          _UINT16_(0x1)                                        /* (SDHC_CR) CMD52 for writing Bus Suspend in CCCR  */
#define   SDHC_CR_CMDTYP_RESUME_Val           _UINT16_(0x2)                                        /* (SDHC_CR) CMD52 for writing Function Select in CCCR  */
#define   SDHC_CR_CMDTYP_ABORT_Val            _UINT16_(0x3)                                        /* (SDHC_CR) CMD12, CMD52 for writing I/O Abort in CCCR  */
#define SDHC_CR_CMDTYP_NORMAL                 (SDHC_CR_CMDTYP_NORMAL_Val << SDHC_CR_CMDTYP_Pos)    /* (SDHC_CR) Other commands Position  */
#define SDHC_CR_CMDTYP_SUSPEND                (SDHC_CR_CMDTYP_SUSPEND_Val << SDHC_CR_CMDTYP_Pos)   /* (SDHC_CR) CMD52 for writing Bus Suspend in CCCR Position  */
#define SDHC_CR_CMDTYP_RESUME                 (SDHC_CR_CMDTYP_RESUME_Val << SDHC_CR_CMDTYP_Pos)    /* (SDHC_CR) CMD52 for writing Function Select in CCCR Position  */
#define SDHC_CR_CMDTYP_ABORT                  (SDHC_CR_CMDTYP_ABORT_Val << SDHC_CR_CMDTYP_Pos)     /* (SDHC_CR) CMD12, CMD52 for writing I/O Abort in CCCR Position  */
#define SDHC_CR_CMDIDX_Pos                    _UINT16_(8)                                          /* (SDHC_CR) Command Index Position */
#define SDHC_CR_CMDIDX_Msk                    (_UINT16_(0x3F) << SDHC_CR_CMDIDX_Pos)               /* (SDHC_CR) Command Index Mask */
#define SDHC_CR_CMDIDX(value)                 (SDHC_CR_CMDIDX_Msk & (_UINT16_(value) << SDHC_CR_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_CR register */
#define SDHC_CR_Msk                           _UINT16_(0x3FFB)                                     /* (SDHC_CR) Register Mask  */


/* -------- SDHC_RR : (SDHC Offset: 0x10) ( R/ 32) Response -------- */
#define SDHC_RR_RESETVALUE                    _UINT32_(0x00)                                       /*  (SDHC_RR) Response  Reset Value */

#define SDHC_RR_CMDRESP_Pos                   _UINT32_(0)                                          /* (SDHC_RR) Command Response Position */
#define SDHC_RR_CMDRESP_Msk                   (_UINT32_(0xFFFFFFFF) << SDHC_RR_CMDRESP_Pos)        /* (SDHC_RR) Command Response Mask */
#define SDHC_RR_CMDRESP(value)                (SDHC_RR_CMDRESP_Msk & (_UINT32_(value) << SDHC_RR_CMDRESP_Pos)) /* Assigment of value for CMDRESP in the SDHC_RR register */
#define SDHC_RR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (SDHC_RR) Register Mask  */


/* -------- SDHC_BDPR : (SDHC Offset: 0x20) (R/W 32) Buffer Data Port -------- */
#define SDHC_BDPR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_BDPR) Buffer Data Port  Reset Value */

#define SDHC_BDPR_BUFDATA_Pos                 _UINT32_(0)                                          /* (SDHC_BDPR) Buffer Data Position */
#define SDHC_BDPR_BUFDATA_Msk                 (_UINT32_(0xFFFFFFFF) << SDHC_BDPR_BUFDATA_Pos)      /* (SDHC_BDPR) Buffer Data Mask */
#define SDHC_BDPR_BUFDATA(value)              (SDHC_BDPR_BUFDATA_Msk & (_UINT32_(value) << SDHC_BDPR_BUFDATA_Pos)) /* Assigment of value for BUFDATA in the SDHC_BDPR register */
#define SDHC_BDPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SDHC_BDPR) Register Mask  */


/* -------- SDHC_PSR : (SDHC Offset: 0x24) ( R/ 32) Present State -------- */
#define SDHC_PSR_RESETVALUE                   _UINT32_(0xF80000)                                   /*  (SDHC_PSR) Present State  Reset Value */

