nammenam/playground/flightcomputer/firmware/src/packs/ATSAME53J18A_DFP/component/sdhc.h
#define SDHC_EISTER_CMDTEO_Pos                _UINT16_(0)                                          /* (SDHC_EISTER) Command Timeout Error Status Enable Position */
#define SDHC_EISTER_CMDTEO_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDTEO_Pos)            /* (SDHC_EISTER) Command Timeout Error Status Enable Mask */
#define SDHC_EISTER_CMDTEO(value)             (SDHC_EISTER_CMDTEO_Msk & (_UINT16_(value) << SDHC_EISTER_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDTEO_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDTEO_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDTEO_MASKED             (SDHC_EISTER_CMDTEO_MASKED_Val << SDHC_EISTER_CMDTEO_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDTEO_ENABLED            (SDHC_EISTER_CMDTEO_ENABLED_Val << SDHC_EISTER_CMDTEO_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDCRC_Pos                _UINT16_(1)                                          /* (SDHC_EISTER) Command CRC Error Status Enable Position */
#define SDHC_EISTER_CMDCRC_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDCRC_Pos)            /* (SDHC_EISTER) Command CRC Error Status Enable Mask */
#define SDHC_EISTER_CMDCRC(value)             (SDHC_EISTER_CMDCRC_Msk & (_UINT16_(value) << SDHC_EISTER_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDCRC_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDCRC_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDCRC_MASKED             (SDHC_EISTER_CMDCRC_MASKED_Val << SDHC_EISTER_CMDCRC_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDCRC_ENABLED            (SDHC_EISTER_CMDCRC_ENABLED_Val << SDHC_EISTER_CMDCRC_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDEND_Pos                _UINT16_(2)                                          /* (SDHC_EISTER) Command End Bit Error Status Enable Position */
#define SDHC_EISTER_CMDEND_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDEND_Pos)            /* (SDHC_EISTER) Command End Bit Error Status Enable Mask */
#define SDHC_EISTER_CMDEND(value)             (SDHC_EISTER_CMDEND_Msk & (_UINT16_(value) << SDHC_EISTER_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDEND_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDEND_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDEND_MASKED             (SDHC_EISTER_CMDEND_MASKED_Val << SDHC_EISTER_CMDEND_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDEND_ENABLED            (SDHC_EISTER_CMDEND_ENABLED_Val << SDHC_EISTER_CMDEND_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDIDX_Pos                _UINT16_(3)                                          /* (SDHC_EISTER) Command Index Error Status Enable Position */
#define SDHC_EISTER_CMDIDX_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDIDX_Pos)            /* (SDHC_EISTER) Command Index Error Status Enable Mask */
#define SDHC_EISTER_CMDIDX(value)             (SDHC_EISTER_CMDIDX_Msk & (_UINT16_(value) << SDHC_EISTER_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDIDX_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDIDX_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDIDX_MASKED             (SDHC_EISTER_CMDIDX_MASKED_Val << SDHC_EISTER_CMDIDX_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDIDX_ENABLED            (SDHC_EISTER_CMDIDX_ENABLED_Val << SDHC_EISTER_CMDIDX_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATTEO_Pos                _UINT16_(4)                                          /* (SDHC_EISTER) Data Timeout Error Status Enable Position */
#define SDHC_EISTER_DATTEO_Msk                (_UINT16_(0x1) << SDHC_EISTER_DATTEO_Pos)            /* (SDHC_EISTER) Data Timeout Error Status Enable Mask */
#define SDHC_EISTER_DATTEO(value)             (SDHC_EISTER_DATTEO_Msk & (_UINT16_(value) << SDHC_EISTER_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDHC_EISTER register */
#define   SDHC_EISTER_DATTEO_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATTEO_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATTEO_MASKED             (SDHC_EISTER_DATTEO_MASKED_Val << SDHC_EISTER_DATTEO_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATTEO_ENABLED            (SDHC_EISTER_DATTEO_ENABLED_Val << SDHC_EISTER_DATTEO_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATCRC_Pos                _UINT16_(5)                                          /* (SDHC_EISTER) Data CRC Error Status Enable Position */
#define SDHC_EISTER_DATCRC_Msk                (_UINT16_(0x1) << SDHC_EISTER_DATCRC_Pos)            /* (SDHC_EISTER) Data CRC Error Status Enable Mask */
#define SDHC_EISTER_DATCRC(value)             (SDHC_EISTER_DATCRC_Msk & (_UINT16_(value) << SDHC_EISTER_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDHC_EISTER register */
#define   SDHC_EISTER_DATCRC_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATCRC_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATCRC_MASKED             (SDHC_EISTER_DATCRC_MASKED_Val << SDHC_EISTER_DATCRC_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATCRC_ENABLED            (SDHC_EISTER_DATCRC_ENABLED_Val << SDHC_EISTER_DATCRC_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATEND_Pos                _UINT16_(6)                                          /* (SDHC_EISTER) Data End Bit Error Status Enable Position */
#define SDHC_EISTER_DATEND_Msk                (_UINT16_(0x1) << SDHC_EISTER_DATEND_Pos)            /* (SDHC_EISTER) Data End Bit Error Status Enable Mask */
#define SDHC_EISTER_DATEND(value)             (SDHC_EISTER_DATEND_Msk & (_UINT16_(value) << SDHC_EISTER_DATEND_Pos)) /* Assigment of value for DATEND in the SDHC_EISTER register */
#define   SDHC_EISTER_DATEND_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATEND_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATEND_MASKED             (SDHC_EISTER_DATEND_MASKED_Val << SDHC_EISTER_DATEND_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATEND_ENABLED            (SDHC_EISTER_DATEND_ENABLED_Val << SDHC_EISTER_DATEND_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CURLIM_Pos                _UINT16_(7)                                          /* (SDHC_EISTER) Current Limit Error Status Enable Position */
#define SDHC_EISTER_CURLIM_Msk                (_UINT16_(0x1) << SDHC_EISTER_CURLIM_Pos)            /* (SDHC_EISTER) Current Limit Error Status Enable Mask */
#define SDHC_EISTER_CURLIM(value)             (SDHC_EISTER_CURLIM_Msk & (_UINT16_(value) << SDHC_EISTER_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDHC_EISTER register */
#define   SDHC_EISTER_CURLIM_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CURLIM_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CURLIM_MASKED             (SDHC_EISTER_CURLIM_MASKED_Val << SDHC_EISTER_CURLIM_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CURLIM_ENABLED            (SDHC_EISTER_CURLIM_ENABLED_Val << SDHC_EISTER_CURLIM_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_ACMD_Pos                  _UINT16_(8)                                          /* (SDHC_EISTER) Auto CMD Error Status Enable Position */
#define SDHC_EISTER_ACMD_Msk                  (_UINT16_(0x1) << SDHC_EISTER_ACMD_Pos)              /* (SDHC_EISTER) Auto CMD Error Status Enable Mask */
#define SDHC_EISTER_ACMD(value)               (SDHC_EISTER_ACMD_Msk & (_UINT16_(value) << SDHC_EISTER_ACMD_Pos)) /* Assigment of value for ACMD in the SDHC_EISTER register */
#define   SDHC_EISTER_ACMD_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_ACMD_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_ACMD_MASKED               (SDHC_EISTER_ACMD_MASKED_Val << SDHC_EISTER_ACMD_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_ACMD_ENABLED              (SDHC_EISTER_ACMD_ENABLED_Val << SDHC_EISTER_ACMD_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_ADMA_Pos                  _UINT16_(9)                                          /* (SDHC_EISTER) ADMA Error Status Enable Position */
#define SDHC_EISTER_ADMA_Msk                  (_UINT16_(0x1) << SDHC_EISTER_ADMA_Pos)              /* (SDHC_EISTER) ADMA Error Status Enable Mask */
#define SDHC_EISTER_ADMA(value)               (SDHC_EISTER_ADMA_Msk & (_UINT16_(value) << SDHC_EISTER_ADMA_Pos)) /* Assigment of value for ADMA in the SDHC_EISTER register */
#define   SDHC_EISTER_ADMA_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_ADMA_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_ADMA_MASKED               (SDHC_EISTER_ADMA_MASKED_Val << SDHC_EISTER_ADMA_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_ADMA_ENABLED              (SDHC_EISTER_ADMA_ENABLED_Val << SDHC_EISTER_ADMA_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_Msk                       _UINT16_(0x03FF)                                     /* (SDHC_EISTER) Register Mask  */

/* EMMC mode */
#define SDHC_EISTER_EMMC_BOOTAE_Pos           _UINT16_(12)                                         /* (SDHC_EISTER) Boot Acknowledge Error Status Enable Position */
#define SDHC_EISTER_EMMC_BOOTAE_Msk           (_UINT16_(0x1) << SDHC_EISTER_EMMC_BOOTAE_Pos)       /* (SDHC_EISTER) Boot Acknowledge Error Status Enable Mask */
#define SDHC_EISTER_EMMC_BOOTAE(value)        (SDHC_EISTER_EMMC_BOOTAE_Msk & (_UINT16_(value) << SDHC_EISTER_EMMC_BOOTAE_Pos))
#define SDHC_EISTER_EMMC_Msk                  _UINT16_(0x1000)                                      /* (SDHC_EISTER_EMMC) Register Mask  */


/* -------- SDHC_NISIER : (SDHC Offset: 0x38) (R/W 16) Normal Interrupt Signal Enable -------- */
#define SDHC_NISIER_RESETVALUE                _UINT16_(0x00)                                       /*  (SDHC_NISIER) Normal Interrupt Signal Enable  Reset Value */

#define SDHC_NISIER_CMDC_Pos                  _UINT16_(0)                                          /* (SDHC_NISIER) Command Complete Signal Enable Position */
#define SDHC_NISIER_CMDC_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CMDC_Pos)              /* (SDHC_NISIER) Command Complete Signal Enable Mask */
#define SDHC_NISIER_CMDC(value)               (SDHC_NISIER_CMDC_Msk & (_UINT16_(value) << SDHC_NISIER_CMDC_Pos)) /* Assigment of value for CMDC in the SDHC_NISIER register */
#define   SDHC_NISIER_CMDC_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CMDC_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CMDC_MASKED               (SDHC_NISIER_CMDC_MASKED_Val << SDHC_NISIER_CMDC_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CMDC_ENABLED              (SDHC_NISIER_CMDC_ENABLED_Val << SDHC_NISIER_CMDC_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_TRFC_Pos                  _UINT16_(1)                                          /* (SDHC_NISIER) Transfer Complete Signal Enable Position */
#define SDHC_NISIER_TRFC_Msk                  (_UINT16_(0x1) << SDHC_NISIER_TRFC_Pos)              /* (SDHC_NISIER) Transfer Complete Signal Enable Mask */
#define SDHC_NISIER_TRFC(value)               (SDHC_NISIER_TRFC_Msk & (_UINT16_(value) << SDHC_NISIER_TRFC_Pos)) /* Assigment of value for TRFC in the SDHC_NISIER register */
#define   SDHC_NISIER_TRFC_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_TRFC_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_TRFC_MASKED               (SDHC_NISIER_TRFC_MASKED_Val << SDHC_NISIER_TRFC_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_TRFC_ENABLED              (SDHC_NISIER_TRFC_ENABLED_Val << SDHC_NISIER_TRFC_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BLKGE_Pos                 _UINT16_(2)                                          /* (SDHC_NISIER) Block Gap Event Signal Enable Position */
#define SDHC_NISIER_BLKGE_Msk                 (_UINT16_(0x1) << SDHC_NISIER_BLKGE_Pos)             /* (SDHC_NISIER) Block Gap Event Signal Enable Mask */
#define SDHC_NISIER_BLKGE(value)              (SDHC_NISIER_BLKGE_Msk & (_UINT16_(value) << SDHC_NISIER_BLKGE_Pos)) /* Assigment of value for BLKGE in the SDHC_NISIER register */
#define   SDHC_NISIER_BLKGE_MASKED_Val        _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BLKGE_ENABLED_Val       _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BLKGE_MASKED              (SDHC_NISIER_BLKGE_MASKED_Val << SDHC_NISIER_BLKGE_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BLKGE_ENABLED             (SDHC_NISIER_BLKGE_ENABLED_Val << SDHC_NISIER_BLKGE_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_DMAINT_Pos                _UINT16_(3)                                          /* (SDHC_NISIER) DMA Interrupt Signal Enable Position */
#define SDHC_NISIER_DMAINT_Msk                (_UINT16_(0x1) << SDHC_NISIER_DMAINT_Pos)            /* (SDHC_NISIER) DMA Interrupt Signal Enable Mask */
#define SDHC_NISIER_DMAINT(value)             (SDHC_NISIER_DMAINT_Msk & (_UINT16_(value) << SDHC_NISIER_DMAINT_Pos)) /* Assigment of value for DMAINT in the SDHC_NISIER register */
#define   SDHC_NISIER_DMAINT_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_DMAINT_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_DMAINT_MASKED             (SDHC_NISIER_DMAINT_MASKED_Val << SDHC_NISIER_DMAINT_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_DMAINT_ENABLED            (SDHC_NISIER_DMAINT_ENABLED_Val << SDHC_NISIER_DMAINT_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BWRRDY_Pos                _UINT16_(4)                                          /* (SDHC_NISIER) Buffer Write Ready Signal Enable Position */
#define SDHC_NISIER_BWRRDY_Msk                (_UINT16_(0x1) << SDHC_NISIER_BWRRDY_Pos)            /* (SDHC_NISIER) Buffer Write Ready Signal Enable Mask */
#define SDHC_NISIER_BWRRDY(value)             (SDHC_NISIER_BWRRDY_Msk & (_UINT16_(value) << SDHC_NISIER_BWRRDY_Pos)) /* Assigment of value for BWRRDY in the SDHC_NISIER register */
#define   SDHC_NISIER_BWRRDY_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BWRRDY_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BWRRDY_MASKED             (SDHC_NISIER_BWRRDY_MASKED_Val << SDHC_NISIER_BWRRDY_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BWRRDY_ENABLED            (SDHC_NISIER_BWRRDY_ENABLED_Val << SDHC_NISIER_BWRRDY_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BRDRDY_Pos                _UINT16_(5)                                          /* (SDHC_NISIER) Buffer Read Ready Signal Enable Position */
#define SDHC_NISIER_BRDRDY_Msk                (_UINT16_(0x1) << SDHC_NISIER_BRDRDY_Pos)            /* (SDHC_NISIER) Buffer Read Ready Signal Enable Mask */
#define SDHC_NISIER_BRDRDY(value)             (SDHC_NISIER_BRDRDY_Msk & (_UINT16_(value) << SDHC_NISIER_BRDRDY_Pos)) /* Assigment of value for BRDRDY in the SDHC_NISIER register */
#define   SDHC_NISIER_BRDRDY_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BRDRDY_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BRDRDY_MASKED             (SDHC_NISIER_BRDRDY_MASKED_Val << SDHC_NISIER_BRDRDY_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BRDRDY_ENABLED            (SDHC_NISIER_BRDRDY_ENABLED_Val << SDHC_NISIER_BRDRDY_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CINS_Pos                  _UINT16_(6)                                          /* (SDHC_NISIER) Card Insertion Signal Enable Position */
#define SDHC_NISIER_CINS_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CINS_Pos)              /* (SDHC_NISIER) Card Insertion Signal Enable Mask */
#define SDHC_NISIER_CINS(value)               (SDHC_NISIER_CINS_Msk & (_UINT16_(value) << SDHC_NISIER_CINS_Pos)) /* Assigment of value for CINS in the SDHC_NISIER register */
#define   SDHC_NISIER_CINS_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CINS_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CINS_MASKED               (SDHC_NISIER_CINS_MASKED_Val << SDHC_NISIER_CINS_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CINS_ENABLED              (SDHC_NISIER_CINS_ENABLED_Val << SDHC_NISIER_CINS_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CREM_Pos                  _UINT16_(7)                                          /* (SDHC_NISIER) Card Removal Signal Enable Position */
#define SDHC_NISIER_CREM_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CREM_Pos)              /* (SDHC_NISIER) Card Removal Signal Enable Mask */
#define SDHC_NISIER_CREM(value)               (SDHC_NISIER_CREM_Msk & (_UINT16_(value) << SDHC_NISIER_CREM_Pos)) /* Assigment of value for CREM in the SDHC_NISIER register */
#define   SDHC_NISIER_CREM_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CREM_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CREM_MASKED               (SDHC_NISIER_CREM_MASKED_Val << SDHC_NISIER_CREM_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CREM_ENABLED              (SDHC_NISIER_CREM_ENABLED_Val << SDHC_NISIER_CREM_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CINT_Pos                  _UINT16_(8)                                          /* (SDHC_NISIER) Card Interrupt Signal Enable Position */
#define SDHC_NISIER_CINT_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CINT_Pos)              /* (SDHC_NISIER) Card Interrupt Signal Enable Mask */
#define SDHC_NISIER_CINT(value)               (SDHC_NISIER_CINT_Msk & (_UINT16_(value) << SDHC_NISIER_CINT_Pos)) /* Assigment of value for CINT in the SDHC_NISIER register */
#define   SDHC_NISIER_CINT_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CINT_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CINT_MASKED               (SDHC_NISIER_CINT_MASKED_Val << SDHC_NISIER_CINT_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CINT_ENABLED              (SDHC_NISIER_CINT_ENABLED_Val << SDHC_NISIER_CINT_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_Msk                       _UINT16_(0x01FF)                                     /* (SDHC_NISIER) Register Mask  */

/* EMMC mode */
#define SDHC_NISIER_EMMC_BOOTAR_Pos           _UINT16_(14)                                         /* (SDHC_NISIER) Boot Acknowledge Received Signal Enable Position */
#define SDHC_NISIER_EMMC_BOOTAR_Msk           (_UINT16_(0x1) << SDHC_NISIER_EMMC_BOOTAR_Pos)       /* (SDHC_NISIER) Boot Acknowledge Received Signal Enable Mask */
#define SDHC_NISIER_EMMC_BOOTAR(value)        (SDHC_NISIER_EMMC_BOOTAR_Msk & (_UINT16_(value) << SDHC_NISIER_EMMC_BOOTAR_Pos))
#define SDHC_NISIER_EMMC_Msk                  _UINT16_(0x4000)                                      /* (SDHC_NISIER_EMMC) Register Mask  */


